blogs/code-style.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-19 三 12:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>极简编码风格</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">极简编码风格</h1>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 缩进</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>两个空格</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 留白</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><code>if</code> <code>else</code> 等关键字左右1个空格</li>
<li>比较操作符、逻辑运算符、算术操作符等左右1个空格</li>
<li><code>{</code> 前面一个空格</li>
<li><code>if</code> <code>for</code> 块儿如果换行，用花括号</li>
<li>行超过100字符换行（不强制）</li>
<li>连续8行没有空行考虑使用函数代替</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> 字符</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>源码UTF8</li>
<li>使用unix换行符</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> 代码块</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>嵌套不超过3层</li>
<li>函数长度不超过50行</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> 重复代码</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>杜绝相似、重复代码</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> 函数命名表达函数的作用而不是函数的实现途径</h2>
<div class="outline-text-2" id="text-6">
<p>
例如：如果是管理Redis缓存那么，CacheManager的名字优于RedisManager。
如果是用randomUUID实现了随机字符串，getRandomString的名字优于getRandomUuidString、getUuidString。
</p>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">7</span> 关于数据库</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>字段少用NOT NULL，不利于业务变更</li>
<li>不用字符串类型做PrimaryKey，优先用自增ID</li>
<li>不写复杂SQL</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">8</span> 关于Java数据类型</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>不用BigDecimal，涉及到金额，优先考虑减小单位，例如用"分"代替"元"做单位</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">9</span> 关于错误和异常</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>需要捕获，然后重新抛出，或转成错误码返回的异常，改成RuntimeException类型的</li>
<li>尽可能多的返回错误信息。例如 String valid(); 返回错误信息，由于 boolean valid(); 仅仅返回对错</li>
<li>不轻易封装错误或异常。env.getRequiredProperty("x") 优于 String x = env.getProperty("x") 然后检查x是不是null</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">10</span> 关于错误日志</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>优先通过返回错误信息的方式表达错误，而不是记录错误日志，然后返回false</li>
<li>错误日志要能够定位错误。logger.warn("name format error"); 这种日志毫无用处</li>
<li>优先用占位符而不是连接符。logger.debug("name format error {}", name); 而不是 logger.debug("name format error " + name);</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2017-04-19 三 12:16</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
